In [2]:
import pandas as pd
df = pd.read_csv("C:/Users/YeldiR/Time_Series/data-science-statistics-journey/dataset/Titanic-Dataset.csv")

In [3]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
#RANGE
age_max = df['Age'].max()
age_min = df['Age'].min()
print(age_max,age_min)

80.0 0.42

In [5]:
age_range = age_max-age_min
print(age_range)

79.58

In [6]:
#IQR
q1 = df['Age'].quantile(0.25)
q3 = df['Age'].quantile(0.75)
print('q1',q1,'q3',q3)
iqr = q3-q1
print(iqr) #how spread out the middle 50% of the data is.

q1 20.125 q3 38.0
17.875

In [7]:
q2 = df['Age'].quantile(0.50)
q2 #median value

np.float64(28.0)

In [8]:
#VARIANCE
df['Age'].var()
#Variance= 14.52..**2=196 â‰ˆ 211. It also measures spread, but in squared units,

np.float64(211.01912474630802)

In [9]:
#Standard Deviation
df['Age'].std()
#mean was 35 and std is 14 it indicates that most ages fall between 21 and 49 (thatâ€™s 35 Â± 14).

np.float64(14.526497332334042)

In [14]:
#Identifying outliers using IQR
low_bound_age = df['Age']-1.5*iqr
upper_bound_age = df['Age']+1.5*iqr
outliers_age = df[(df['Age']<low_bound_age) | (df['Age']>upper_bound_age)]
outliers_age['Age']

Series([], Name: Age, dtype: float64)

In [19]:
#Identifying outliers using IQR
low_bound_fare = df['Fare']-1.5*iqr
upper_bound_fare = df['Fare']+1.5*iqr
outliers_fare = df[(df['Fare']<low_bound_age) | (df['Fare']>upper_bound_age)]
outliers_fare['Fare']

Series([], Name: Fare, dtype: float64)